#include"stm32f4xx.h"

/*
int16_t test_Start[3][15]={
{  1, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  500, 0,  1000,  300,  -50,  -50,   50,   50,  150, -300,  -50, -1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  500, 0, -1000,    0,    0,    0,    0,    0,   50,  100,    0,-1000,  -50,  -50,  -50}//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
};
*/

int16_t test_Start[5][3]={
{3,1,1},
{0xA0,0xB0,0},
{0xC0,0xD0,900},
{0xB0,0xA0,-900},
{0xE0,0xE0,900}
};

int16_t test_End[4][15]={
{  2, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  100, 10,    0,  300,  -50,  -50,   50,   50,  150, -300,  -50,-1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  20, 100, -150,    0,    0,    0,    0,    0,   50,  100,    0,    0,  -50,  -50,  -50},//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
{  50,   1, -250,  100,  100,  100,    0,    0,   50,   80,  150,  500,   50,   50,  -80}
};
