#include"stm32f4xx.h"
#include"motion_data.h"
/*
int16_t test_Start[4][15]={
{  2, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  100, 0,  50,  300,  -50,  -50,   50,   50,  150, -300,  -50, -1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  100, 0,  50,    0,    0,    0,    0,    0,   50,  100,    0,-1000,  -50,  -50,  -50},//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
{  100, 0,    0,  100,  100,  100,    0,    0,   50,   80,  150, -500,   50,   50,  -80}
};

int16_t test_End[4][15]={
{  2, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  100, 10,    0,  300,  -50,  -50,   50,   50,  150, -300,  -50,-1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  20, 100, -150,    0,    0,    0,    0,    0,   50,  100,    0,    0,  -50,  -50,  -50},//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
{  50,   1, -250,  100,  100,  100,    0,    0,   50,   80,  150,  500,   50,   50,  -80}
};
*/
