#include"stm32f4xx.h"

/*
int16_t test_Start[3][15]={
{  1, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  500, 0,  1000,  300,  -50,  -50,   50,   50,  150, -300,  -50, -1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  500, 0, -1000,    0,    0,    0,    0,    0,   50,  100,    0,-1000,  -50,  -50,  -50}//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
};
*/

int16_t test_Start[4][3]={
{2,1,1},
{100,200,0xFC7C},
{100,100,0},
{100,100,0x0384}
};

int16_t test_End[4][15]={
{  2, 13,    1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,   12,   13},//(一個目モーションの総フレーム数、二個目サーボの総数、三個目以降が指定したID)
{  100, 0,    0,  300,  -50,  -50,   50,   50,  150, -300,  -50,-1500,  -50,  -50,  100},//初期姿勢(一個目移動時間、二個目待機時間、三個目以降角度)
{  50, 0, -900,    0,    0,    0,    0,    0,   50,  100,    0,    0,  -50,  -50,  -50},//以下モーションデータ(一個目移動時間、二個目待機時間、三個目以降角度)
{  50,100, -1500,  100,  100,  100,    0,    0,   50,   80,  150,  500,   50,   50,  -80}
};
